In [26]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np

In [27]:
# Loading the housing price dataset (assuming the file name is "housing_price.csv")
import pandas as pd
# 1 TABLE --> df_final_demo
df1 = pd.read_csv("data/raw/df_final_demo.txt")
df1.shape

(70609, 9)

In [28]:
#df_final_demo (File 1)
df1.head()

,client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth
0,836976,6.0,73.0,60.5,U,2.0,45105.30,6.0,9.0
1,2304905,7.0,94.0,58.0,U,2.0,110860.30,6.0,9.0
2,1439522,5.0,64.0,32.0,U,2.0,52467.79,6.0,9.0
3,1562045,16.0,198.0,49.0,M,2.0,67454.65,3.0,6.0
4,5126305,12.0,145.0,33.0,F,2.0,103671.75,0.0,3.0

In [29]:
#Data Cleaning for df_final_demo.txt
df1.nunique()

client_id           70609
clnt_tenure_yr         54
clnt_tenure_mnth      482
clnt_age              165
gendr                   4
num_accts               8
bal                 70328
calls_6_mnth            8
logons_6_mnth           9
dtype: int64

In [30]:
df1.gendr.unique()
#df1['gendr'].fillna(' ')
df1['gendr'].value_counts()

#Replace gendr X and U for nothing
df1['gendr'] = df1['gendr'].replace({'X': ' ', 'U': ' '})
df1['gendr'].value_counts()

gendr
     24125
M    23724
F    22746
Name: count, dtype: int64

In [31]:
# 2 TABLE --> df_final_web_data_pt_1

In [32]:
import pandas as pd
df2 = pd.read_csv("data/raw/df_final_web_data_pt_1.txt")
df2.shape

(343141, 5)

In [33]:
#df_final_web_data_pt_1 (File 3)
df2.head()

,client_id,visitor_id,visit_id,process_step,date_time
0,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:27:07
1,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:26:51
2,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:19:22
3,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:19:13
4,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:18:04

In [34]:
#number of clients id
df2.nunique()
df2.client_id.nunique()

58391

In [35]:
import pandas as pd
df3 = pd.read_csv("data/raw/df_final_web_data_pt_2.txt")
df3.shape

(412264, 5)

In [36]:
#df_final_web_data_pt_2 (File 4)
df3.head()

,client_id,visitor_id,visit_id,process_step,date_time
0,763412,601952081_10457207388,397475557_40440946728_419634,confirm,2017-06-06 08:56:00
1,6019349,442094451_91531546617,154620534_35331068705_522317,confirm,2017-06-01 11:59:27
2,6019349,442094451_91531546617,154620534_35331068705_522317,step_3,2017-06-01 11:58:48
3,6019349,442094451_91531546617,154620534_35331068705_522317,step_2,2017-06-01 11:58:08
4,6019349,442094451_91531546617,154620534_35331068705_522317,step_1,2017-06-01 11:57:58

In [37]:
df3.nunique()

client_id        67430
visitor_id       71042
visit_id         82841
process_step         5
date_time       346697
dtype: int64

In [38]:
#concat df2 and df3
#pd.concat([df2_client_id, df3_client_id], axis=1)
new_df2_df3 = pd.concat([df2, df3], axis=0)
display(new_df2_df3)
new_df2_df3.nunique()

,client_id,visitor_id,visit_id,process_step,date_time
0,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:27:07
1,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:26:51
2,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:19:22
3,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:19:13
4,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:18:04
...,...,...,...,...,...
412259,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:46:10
412260,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:45:29
412261,9668240,388766751_9038881013,922267647_3096648104_968866,step_1,2017-05-24 18:44:51
412262,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:44:34
412263,674799,947159805_81558194550,86152093_47511127657_716022,start,2017-06-03 12:17:09

client_id       120157
visitor_id      130236
visit_id        158095
process_step         5
date_time       629363
dtype: int64

In [39]:
# Loading the housing price dataset (assuming the file name is "housing_price.csv")
import pandas as pd
df4 = pd.read_csv("data/raw/df_final_experiment_clients.txt")
df4.shape

(70609, 2)

In [40]:
#df_final_experiment_clients (File 2)
df4.head()

   client_id Variation
0    9988021      Test
1    8320017      Test
2    4033851   Control
3    1982004      Test
4    9294070   Control

In [41]:
df4.nunique()
#df4.client_id.nunique()

client_id    70609
Variation        2
dtype: int64

In [42]:

#concat df1(client_id, clnt_tenure_yr, clnt_tenure_mon, clnt_age, gend, num_accts, bal, cal_6_mnths, logons_6_mnths) + df4(client_id, variation)
new_df1_df4 = pd.merge(df1, df4)
display(new_df1_df4)
new_df1_df4.nunique()

,client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth,Variation
0,836976,6.0,73.0,60.5,,2.0,45105.30,6.0,9.0,Test
1,2304905,7.0,94.0,58.0,,2.0,110860.30,6.0,9.0,Control
2,1439522,5.0,64.0,32.0,,2.0,52467.79,6.0,9.0,Test
3,1562045,16.0,198.0,49.0,M,2.0,67454.65,3.0,6.0,Test
4,5126305,12.0,145.0,33.0,F,2.0,103671.75,0.0,3.0,Control
...,...,...,...,...,...,...,...,...,...,...
70604,7993686,4.0,56.0,38.5,,3.0,1411062.68,5.0,5.0,NaN
70605,8981690,12.0,148.0,31.0,M,2.0,101867.07,6.0,6.0,NaN
70606,333913,16.0,198.0,61.5,F,2.0,40745.00,3.0,3.0,NaN
70607,1573142,21.0,255.0,68.0,M,3.0,475114.69,4.0,4.0,NaN
70608,5602139,21.0,254.0,59.5,F,3.0,157498.73,7.0,7.0,NaN

client_id           70609
clnt_tenure_yr         54
clnt_tenure_mnth      482
clnt_age              165
gendr                   3
num_accts               8
bal                 70328
calls_6_mnth            8
logons_6_mnth           9
Variation               2
dtype: int64

In [43]:
#df1.gendr.unique()
#df1['gendr'].fillna(' ')
new_df1_df4['gendr'].value_counts()

#Replace gendr X and U for nothing
new_df1_df4['gendr'] = df1['gendr'].replace({'X': ' ', 'U': ' '})
#df1['gendr'].value_counts()

In [44]:
new_df1_df4['gendr'].value_counts()

gendr
     24125
M    23724
F    22746
Name: count, dtype: int64

In [45]:
new_df1_df4.Variation.unique()
new_df1_df4['Variation'].value_counts()

Variation
Test       26968
Control    23532
Name: count, dtype: int64

In [ ]:
#DAY 3 SUCCESS INDICATORS
#new_df2_df3['client_id'].value_counts()
#new_df2_df3['visitor_id'].value_counts()
#new_df2_df3['visit_id'].value_counts()

#Completion rate: The total users who reach the final 'confirm step' were 102963
#new_df2_df3['process_step'].value_counts()

#Time spent on each step: 
#to calculate the average date_time of each step

#1. Ensure date_time is in datetime format
new_df2_df3['date_time'] = pd.to_datetime(new_df2_df3['date_time'])

# 2. Sort by user and time
new_df2_df3 = new_df2_df3.sort_values(by=['client_id', 'date_time'])
# 3. Calculate time difference to next row per user (new columns time_spent is added)
new_df2_df3['time_spent'] = new_df2_df3.groupby('client_id')['date_time'].shift(-1) - new_df2_df3['date_time']

# 4. Compute average time spent per process_step 
avg_time_per_step = new_df2_df3.groupby('process_step')['time_spent'].mean()

print(avg_time_per_step)

#testing
#print(new_df2_df3.columns)
#print(new_df2_df3['date_time'].dtype)
#print(new_df2_df3['date_time'].isnull().sum())
#print(new_df2_df3['process_step'].unique())
#print(new_df2_df3[['client_id', 'process_step', 'date_time', 'time_spent']].head(10))

process_step
confirm   3 days 00:13:54.903339743
start     0 days 22:57:48.680451110
step_1    0 days 09:20:59.881194241
step_2    0 days 05:14:25.662991014
step_3    0 days 09:01:39.903402084
Name: time_spent, dtype: timedelta64[ns]

In [ ]:
#DAY 3 SUCCESS INDICATORS
# Error Rates: If there's a step where users go back to a previous step, it may indicate confusion or an error. You should consider moving from a later step to an earlier one as an error.

In [62]:
#1. to order by client_id and date_time
new_df2_df3 = new_df2_df3.sort_values(by=['client_id', 'date_time'])

#2. To calculate the next step for each user
new_df2_df3['next_step'] = new_df2_df3.groupby('client_id')['process_step'].shift(-1)

#3. To check if went back
new_df2_df3['error_backstep'] = new_df2_df3['next_step'] < new_df2_df3['process_step']
#this creates a col booleana T/F

#number of errors per step
error_count_by_step = new_df2_df3.groupby('process_step')['error_backstep'].sum()
print(error_count_by_step.sort_values(ascending=False))

#%
error_percentage_by_step = new_df2_df3.groupby('process_step')['error_backstep'].mean() * 100
# Mostrar el resultado ordenado
print(error_percentage_by_step.sort_values(ascending=False))

process_step
step_3     102721
step_1      28577
step_2      20428
start         284
confirm         0
Name: error_backstep, dtype: int64
process_step
step_3     91.517436
step_1     17.511168
step_2     15.352242
start       0.116420
confirm     0.000000
Name: error_backstep, dtype: float64